/**/
"Cancel" = "Abbrechen";
/**/
"Delete" = "Löschen";
/**/
"Open" = "Öffnen";
/**/
"Edit" = "Bearbeiten";
/**/
"Yes" = "Ja";
/**/
"Finish" = "Fertigstellen";
/**/
"Done" = "Fertig";
/**/
"Save" = "Speichern";
/**/
"Undo" = "Rückgängig";
/**/
"Redo" = "Wiederherstellen";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Ja, löschen";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Geometrie anwenden";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Geometrie löschen";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Stützpunkt löschen";
/*Geometry Edit Action Name*/
"Insert Part" = "Teil einfügen";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Stützpunkt einfügen";
/*Geometry Edit Action Name*/
"Move Vertex" = "Stützpunkt verschieben";
/*Geometry Edit Action Name*/
"Remove Part" = "Teil entfernen";

/*Collecting attachments*/
"Add" = "Hinzufügen";
/*Collecting attachments*/
"Take Photo or Video" = "Foto oder Video aufnehmen";
/*Collecting attachments*/
"Choose From Library" = "Aus Bibliothek auswählen";
/*Collecting attachments*/
"Photo" = "Foto";
/*Collecting attachments*/
"Video" = "Video";
/*Collecting attachments*/
"Save To Photo Library" = "In Fotobibliothek speichern";
/*Collecting attachments*/
"Download" = "Herunterladen";

/*Date attribute*/
"Today" = "Heute";

/**/
"Attachments" = "Anlagen";
"Attributes" = "Attribute";

/**/
"Open in Safari" = "In Safari öffnen";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Geben Sie eine Zahl zwischen %i und %i ein.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Geben Sie eine Zahl zwischen %@ und %@ ein.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Zu viele Zeichen (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Zahl liegt außerhalb des zulässigen Bereichs.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Feldtyp wird nicht unterstützt";

/**/
"%d of %d" = "%d von %d";

/**/
"Changing Feature Type" = "Feature-Typ ändern";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Sie ändern den Feature-Typ und überschreiben damit möglicherweise einige Feldwerte. Möchten Sie den Vorgang fortführen?";

/**/
"Deleting Feature" = "Feature wird gelöscht";
"Are you sure you want to delete this feature?" = "Möchten Sie dieses Feature wirklich löschen?";

/**/
"Data for pie chart is invalid" = "Ungültige Daten für das Tortendiagramm";
"No data to create a pie chart" = "Keine Daten zum Erstellen eines Tortendiagramms";
"No image to display" = "Kein Bild, das angezeigt werden kann";

/**/
"Created by %@ seconds ago" = "Von %@ kurz zuvor erstellt";

/**/
"Created by %@ a minute ago" = "Von %@ vor 1 Minute erstellt";

/**/
"Edited by %@ seconds ago" = "Von %@ kurz zuvor bearbeitet";

/**/
"Edited by %@ a minute ago" = "Von %@ vor 1 Minute bearbeitet";

/**/
"Created seconds ago" = "Kurz zuvor erstellt";

/**/
"Created a minute ago" = "Vor 1 Minute erstellt";

/**/
"Edited seconds ago" = "Kurz zuvor bearbeitet";

/**/
"Edited a minute ago" = "Vor 1 Minute bearbeitet";

/**/
"Created by %@ %d minutes ago" = "Von %@ vor %d Minuten erstellt";

/**/
"Created by %@ an hour ago" = "Von %@ vor 1 Stunde erstellt";

/**/
"Created by %@ %d hours ago" = "Von %@ vor %d Stunden erstellt";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Von %@ am %@ um %@ erstellt";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Von %@ am %@ um %@ erstellt";

/**/
"Edited by %@ %d minutes ago" = "Von %@ vor %d Minuten bearbeitet";

/**/
"Edited by %@ an hour ago" = "Von %@ vor 1 Stunde bearbeitet";

/**/
"Edited by %@ %d hours ago" = "Von %@ vor %d Stunden bearbeitet";

/**/
"Edited by %@ on %@ at %@ - day" = "Von %@ am %@ um %@ bearbeitet";

/**/
"Edited by %@ on %@ at %@ - full" = "Von %@ am %@ um %@ bearbeitet";

/**/
"Created by %@" = "Von %@ erstellt";

/**/
"Edited by %@" = "Von %@ bearbeitet";

/**/
"Created %d minutes ago" = "Vor %d Minuten erstellt";

/**/
"Created an hour ago" = "Vor 1 Stunde erstellt";

/**/
"Created %d hours ago" = "Vor %d Stunden erstellt";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Am %@ um %@ erstellt";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Am %@ um %@ erstellt";

/**/
"Edited %d minutes ago" = "Vor %d Minuten bearbeitet";

/**/
"Edited an hour ago" = "Vor 1 Stunde bearbeitet";

/**/
"Edited %d hours ago" = "Vor %d Stunden bearbeitet";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Am %@ um %@ bearbeitet";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Am %@ um %@ bearbeitet";

/* Used to denote a required field */
"Required" = "Erforderlich";

/* Used for naming layers with no names */
"Layer %d" = "Layer %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Für die Position wurde keine Adresse gefunden";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Für die Adresse wurde keine Position gefunden";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Adresse kann nicht gelesen werden";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Datei nicht gefunden";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Locator kann nicht geladen werden";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Interner Locator-Fehler";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Locator unterstützt keine Geokodierung an Kreuzungen";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Ungültige Locator-Eigenschaften";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Pflichtfeld fehlt";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Locator wurde nicht initialisiert";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Nicht unterstütztes Locator-Format";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Nicht unterstützte Projektionstransformation";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Nicht unterstützter Raumbezug";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Rückwärts-Geokodierung wird von diesem Locator nicht unterstützt.";

/* Network analyst errors */
"Cannot open network." = "Netzwerk kann nicht geöffnet werden.";
"Cannot retrieve route task parameters." = "Routen-Task-Parameter können nicht abgerufen werden.";
"Insufficient number of stops." = "Unzureichende Anzahl von Stopps.";
"Stop (%@) was not located." = "Stopp (%@) wurde nicht verortet.";
"Stop (%@) is located on a non traversable element." = "Stopp (%@) befindet sich auf einem nicht passierbaren Element.";
"Stop (%@) is located on a soft restricted element." = "Stopp (%@) befindet sich auf einem Element mit weicher Beschränkung.";
"Point barrer (%@) was not located." = "Punkt-Barriere (%@) wurde nicht verortet.";
"Point barrier (%@) has invalid added cost attribute name." = "Punkt-Barriere (%@) wurde ungültiger Kostenattributname hinzugefügt.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Linien-Barriere (%@) weist ungültigen skalierten Kostenattributnamen auf.";
"Line barrier (%@) does not cover any network elements." = "Linien-Barriere (%@) deckt keine Netzwerkelemente ab.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Polygon-Barriere (%@) weist ungültigen skalierten Kostenattributnamen auf.";
"Polygon barrier (%@) does not cover any network elements." = "Polygon-Barriere (%@) deckt keine Netzwerkelemente ab.";
"'%@' is an invalid impedance attribute." = "'%@' ist ein ungültiges Impedanzattribut.";
"'%@' restriction attribute is invalid." = "Das Restriktionsattribut '%@' ist ungültig.";
"'%@' accumulate attribute is invalid." = "Das Akkumulationsattribut '%@' ist ungültig.";
"'%@' is an invalid directions time attribute." = "'%@' ist ein ungültiges Zeitattribut für Wegbeschreibungen.";
"Directions distance attribute is invalid." = "Das Streckenattribut für Wegbeschreibungen ist ungültig.";
"Invalid attribute parameter attribute name (%@)." = "Ungültiger Attributname für Attributparameter (%@).";
"Invalid attribute parameter parameter name (%@)." = "Ungültiger Parametername für Attributparameter (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Ungültiger Werttyp für Parameter (%2$@) für Attribut (%1$@)";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Ungültiger \"Restriction Usage\"-Wert für Parameter (%2$@) für Attribut (%1$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neutraler \"Restriction Usage\"-Wert für Parameter (%2$@) für Attribut (%1$@)";
"Soft restricted element (%@) was traversed." = "Element mit weicher Beschränkung (%@) wurde durchlaufen.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Das Netzwerk weist kein Hierarchieattribut für hierarchische Routenplanung auf.";
"No path can be found between a given pair of stops (%@)." = "Zwischen zwei angegebenen Stopps (%@) kann kein Pfad gefunden werden.";
"The input spatial reference is undefined." = "Der eingegebene Raumbezug ist nicht definiert.";
"The output spatial reference is undefined." = "Der ausgegebene Raumbezug ist nicht definiert.";
"The directions style is invalid." = "Der Style für Wegbeschreibungen ist ungültig.";
"The directions language is invalid." = "Die Sprache für Wegbeschreibungen ist ungültig.";
"Directions time and distance attributes do not match." = "Die Zeit- und Entfernungsattribute für Wegbeschreibungen stimmen nicht überein.";
"The directions road class attribute is invalid." = "Das Attribut einer Straßenklasse für Wegbeschreibungen ist ungültig.";
"Unknown condition." = "Unbekannte Bedingung.";
"Invalid route task parameters." = "Ungültige Routen-Task-Parameter.";
"Route task's solution cannot be found." = "Berechnung des Routen-Task kann nicht gefunden werden.";
"Route task was cancelled." = "Routen-Task wurde abgebrochen.";
"Route task internal error." = "Interner Routen-Task-Fehler.";
"Route name property is not supported for local route task." = "Nameneigenschaft der Route für lokalen Routen-Task wird nicht unterstützt.";
"Local route task parameters should be retrieved from route task." = "Parameter für lokalen Routen-Task konnten nicht von Routen-Task abgerufen werden.";
"Cannot retrieve network description." = "Netzwerkbeschreibung kann nicht abgerufen werden.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Für impedanceAttributeName und accumulateAttributeNames kann nur ein Längenattribut angegeben werden.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Für impedanceAttributeName und accumulateAttributeNames kann nur ein Zeitattribut angegeben werden.";
"Service not supported." = "Service wird nicht unterstützt.";
"Specified start time occurs before January 1, 1970." = "Angegebene Startzeit liegt vor dem 1. Januar 1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Stopp (%@) hat eine Startzeit, die vor dem 1. Januar 1970 liegt.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Stopp (%@) hat ein lokales Zeitfenster, das vor dem 1. Januar 1970 startet.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Stopp (%@) hat ein UTC-Zeitfenster, das vor dem 1. Januar 1970 startet.";
"Stop (%@) has a time window end that occurs before its time window start." = "Stopp (%@) hat ein Zeitfenster-Ende, das vor dem Zeitfenster-Start liegt.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "Pkt";
"Unknown" = "Unbekannt";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Zentimeter";
"Decimal Degrees" = "Dezimalgrad";
"Decimeters" = "Dezimeter";
"Feet" = "Fuß";
"Inches" = "Zoll";
"Kilometers" = "Kilometer";
"Meters" = "Meter";
"Miles" = "Meilen";
"Millimeters" = "Millimeter";
"Nautical Miles" = "Seemeilen";
"Points" = "Punkte";
"Yards" = "Yard";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "qmm";
"sq. cm" = "qcm";
"sq. dm" = "qdm";
"sq. m" = "qm";
"ares" = "Ar";
"ha" = "ha";
"sq. km" = "qkm";

/* Area Units Display Strings */
"Square Inches" = "Quadratinch";
"Square Feet" = "Quadratfuß";
"Square Yards" = "Quadratyards";
"Acres" = "Acres";
"Square Miles" = "Quadratmeilen";
"Square Millimeters" = "Quadratmillimeter";
"Square Centimeters" = "Quadratzentimeter";
"Square Decimeters" = "Quadratdezimeter";
"Square Meters" = "Quadratmeter";
"Ares" = "Ar";
"Hectares" = "Hektar";
"Square Kilometers" = "Quadratkilometer";

/* Errors */
"Error" = "Fehler";
"Class not @protocol AGSJSONSerializable compliant" = "Klasse nicht mit @protocol AGSJSONSerializable kompatibel";
"Authorization required" = "Autorisierung erforderlich";
"Token is invalid or has expired" = "Token ist ungültig oder abgelaufen";
"Unknown error occurred" = "Unbekannter Fehler";
"Empty username/password" = "Benutzername/Kennwort leer";
"Token URL is nil. You must set a valid token URL on the credential." = "Token-URL fehlt. Bitte geben Sie eine gültige Token-URL in den Anmeldedaten an.";
"Unknown authentication error" = "Unbekannter Authentifizierungsfehler";
"Error extracting identity" = "Fehler beim Extrahieren der Kennung";
"Error adding identity to the keychain" = "Fehler beim Hinzufügen der Kennung zur Schlüsselkette";
"Invalid Credentials" = "Ungültige Anmeldeinformationen";
"Bad URL." = "Falsche URL.";
"The feature layer does not expose an object-id field." = "Der Feature-Layer zeigt kein ObjectID-Feld.";
"Both geodatabase and syncParams are required for this method." = "Für diese Methode sind die Parameter geodatabase und syncParams erforderlich.";
"Uploading deltas is not supported with this replica." = "Das Hochladen von Deltas mit diesem Replikat wird nicht unterstützt.";
"Error creating delta geodatabase" = "Erstellen von Delta-Geodatabase fehlgeschlagen";
"Unable to create result image layer" = "Ergebnis-Bild-Layer kann nicht erstellt werden";
"Cache at path '%@' not found." = "Cache in Pfad '%@' nicht gefunden.";
"To add an item, you must be logged in to the portal." = "Sie müssen im Portal angemeldet sein, um ein Element hinzufügen zu können.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Um ein Element hinzufügen zu können, müssen Sie unter AGSPortalItemContentParameters einen Wert angeben.";
"The portal failed to add the item." = "Das Portal konnte das Element nicht hinzufügen.";
"To delete an item, you must be logged in to the portal." = "Um ein Element löschen zu können, müssen Sie im Portal angemeldet sein.";
"The portal failed to delete the item." = "Das Portal konnte das Element nicht löschen.";
"To update an item, an itemId and logged in user are required." = "Zum Aktualisieren eines Elements sind ein angemeldeter Benutzer nebst itemId erforderlich.";
"The item failed to update." = "Element konnte nicht aktualisiert werden.";
"The item failed to update JSON." = "Aktualisierung von JSON durch Element fehlgeschlagen.";
"You must be logged in to a portal to add a comment." = "Um einen Kommentar hinzufügen zu können, müssen Sie im Portal angemeldet sein.";
"The comment failed to be added." = "Der Kommentar konnte nicht hinzugefügt werden.";
"You must be logged in to a portal to fetch the current user's rating." = "Um die Bewertung des aktuellen Benutzers einsehen zu können, müssen Sie in einem Portal angemeldet sein.";
"You must be logged in to a portal to add a rating." = "Sie müssen in einem Portal angemeldet sein, um eine Bewertung hinzufügen zu können.";
"The rating failed to be added." = "Die Bewertung konnte nicht hinzugefügt werden.";
"To share an item, you must be logged in to the portal." = "Um ein Element freigeben zu können, müssen Sie im Portal angemeldet sein.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Um die Freigabe eines Elements aufzuheben, müssen Sie im Portal angemeldet sein und diejenigen Gruppen angeben, für die die Freigabe aufgehoben werden soll.";
"Bad Request" = "Fehlerhafte Anfrage";
"Credential Required" = "AGSCredential erforderlich";
"Job not created" = "Auftrag wurde nicht erstellt";
"Service did not return a valid URL" = "Service hat keine gültige URL zurückgeliefert";
"Service did not return a file" = "Service hat keine Datei zurückgeliefert";
"Service did not return a size" = "Service hat keine Größe zurückgeliefert";
"Job failed" = "Auftrag konnte nicht durchgeführt werden";
"Job timed out" = "Auftrag hat das Zeitlimit überschritten";
"Job was cancelled" = "Auftrag wurde abgebrochen";
"Job was deleted" = "Auftrag wurde gelöscht";
"Feature with objectId: %d not found" = "Feature mit ObjectId: %d nicht gefunden";
"No object-id values specified for feature table query." = "Keine Objekt-ID-Werte für Feature-Tabellenabfrage angegeben.";

/* OAuth */
"The specified clientID is invalid" = "Die angegebene clientID ist ungültig";

/* Sync */
"Upload is not supported with this service." = "Der Upload wird von diesem Service nicht unterstützt.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Um eine Synchronisierung aufzurufen, muss eine andere Synchronisierungsrichtung als AGSGDBSyncDirectionNone angegeben werden.";